prodigylinda/ESP32_deskdog_ROM/managed_components/m5stack__m5ioe1/src/M5IOE1_i2c_compat.h
/*
 * SPDX-FileCopyrightText: 2026 M5Stack Technology CO LTD
 *
 * SPDX-License-Identifier: MIT
 */

#ifndef __M5IOE1_I2C_COMPAT_H__
#define __M5IOE1_I2C_COMPAT_H__

#include <stdint.h>
#include <stdbool.h>
#include <string.h>

// ============================
// I2C 延迟配置 (可调整以解决总线冲突)
// I2C Delay Configuration (adjustable to resolve bus conflicts)
// 适用于所有平台和驱动 (Arduino Wire / M5Unified / i2c_master / i2c_bus / Legacy)
// Applies to all platforms and drivers (Arduino Wire / M5Unified / i2c_master / i2c_bus / Legacy)
// ============================
#ifndef M5IOE1_I2C_WRITE_DELAY_US
#define M5IOE1_I2C_WRITE_DELAY_US 500  // 写操作后延迟(微秒) / Delay after write (microseconds)
#endif

#ifndef M5IOE1_I2C_READ_DELAY_US
#define M5IOE1_I2C_READ_DELAY_US 500  // 读操作前/后延迟(微秒) / Delay around read (microseconds)
#endif

// 微秒级延迟宏 (平台无关) / Microsecond delay macro (platform-agnostic)
#ifdef ARDUINO
#define M5IOE1_I2C_DELAY_US(us) delayMicroseconds(us)
#else
#define M5IOE1_I2C_DELAY_US(us) esp_rom_delay_us(us)
#endif

#ifdef ARDUINO

#include "Wire.h"

// ============================
// Arduino I2C 功能
// Arduino I2C Functions
// ============================

#ifndef M5IOE1_I2C_ARDUINO_READ_BYTE
static inline bool M5IOE1_I2C_ARDUINO_READ_BYTE(TwoWire *wire, uint8_t addr, uint8_t reg, uint8_t *data)
{
    wire->beginTransmission(addr);
    wire->write(reg);
    if (wire->endTransmission(false) != 0) {
        return false;
    }
    delayMicroseconds(M5IOE1_I2C_READ_DELAY_US);  // 增加延迟避免 I2C 总线冲突 / extra delay to avoid bus conflicts
    if (wire->requestFrom(addr, (uint8_t)1) != 1) {
        return false;
    }
    *data = wire->read();
    return true;
}
#endif

#ifndef M5IOE1_I2C_ARDUINO_READ_BYTES
static inline bool M5IOE1_I2C_ARDUINO_READ_BYTES(TwoWire *wire, uint8_t addr, uint8_t start_reg, size_t len,
                                                 uint8_t *data)
{
    wire->beginTransmission(addr);
    wire->write(start_reg);
    if (wire->endTransmission(false) != 0) {
        return false;
    }
    delayMicroseconds(M5IOE1_I2C_READ_DELAY_US);  // 增加延迟避免 I2C 总线冲突
    if (wire->requestFrom(addr, (uint8_t)len) != len) {
        return false;
    }
    for (size_t i = 0; i < len; i++) {
        data[i] = wire->read();
    }
    return true;
}
#endif

#ifndef M5IOE1_I2C_ARDUINO_READ_REG16
static inline bool M5IOE1_I2C_ARDUINO_READ_REG16(TwoWire *wire, uint8_t addr, uint8_t reg, uint16_t *data)
{
    uint8_t buf[2];
    if (!M5IOE1_I2C_ARDUINO_READ_BYTES(wire, addr, reg, 2, buf)) {
        return false;
    }
    // 小端模式：低字节在前
    // Little-endian: low byte first
    *data = (uint16_t)buf[0] | ((uint16_t)buf[1] << 8);
    return true;
}
#endif

#ifndef M5IOE1_I2C_ARDUINO_WRITE_BYTE
static inline bool M5IOE1_I2C_ARDUINO_WRITE_BYTE(TwoWire *wire, uint8_t addr, uint8_t reg, uint8_t data)
{
    wire->beginTransmission(addr);
    wire->write(reg);
    wire->write(data);
    if (wire->endTransmission() != 0) {
        return false;
    }
    delayMicroseconds(M5IOE1_I2C_WRITE_DELAY_US);  // 增加延迟给设备处理时间
    return true;
}
#endif

#ifndef M5IOE1_I2C_ARDUINO_WRITE_BYTES
static inline bool M5IOE1_I2C_ARDUINO_WRITE_BYTES(TwoWire *wire, uint8_t addr, uint8_t start_reg, size_t len,
                                                  const uint8_t *data)
{
    wire->beginTransmission(addr);
    wire->write(start_reg);
    for (size_t i = 0; i < len; i++) {
        wire->write(data[i]);
    }
    if (wire->endTransmission() != 0) {
        return false;
    }
    delayMicroseconds(M5IOE1_I2C_WRITE_DELAY_US);  // 增加延迟给设备处理时间
    return true;
}
#endif

#ifndef M5IOE1_I2C_ARDUINO_WRITE_REG16
static inline bool M5IOE1_I2C_ARDUINO_WRITE_REG16(TwoWire *wire, uint8_t addr, uint8_t reg, uint16_t data)
{
    uint8_t buf[2];
    // 小端模式：低字节在前
    // Little-endian: low byte first
    buf[0] = (uint8_t)(data & 0xFF);
    buf[1] = (uint8_t)((data >> 8) & 0xFF);
    return M5IOE1_I2C_ARDUINO_WRITE_BYTES(wire, addr, reg, 2, buf);
}
#endif

// 唤醒信号发送 / Wake signal send
// IOE1 使用 SDA 引脚下降沿触发唤醒中断
// IOE1 uses SDA pin falling edge to trigger wake interrupt
#ifndef M5IOE1_I2C_ARDUINO_SEND_WAKE
static inline void M5IOE1_I2C_ARDUINO_SEND_WAKE(TwoWire *wire, uint8_t addr)
{
    // Send START then STOP to avoid leaving the bus in a busy state
    wire->beginTransmission(addr);
    wire->endTransmission();  // Send START with STOP
}
#endif

// ============================
// M5Unified I2C_Class 检测 (Arduino)
// M5Unified I2C_Class Detection (Arduino)
// ============================
#if defined(__cplusplus) && __has_include(<utility/I2C_Class.hpp>)
#define M5IOE1_HAS_M5UNIFIED_I2C 1
#include <utility/I2C_Class.hpp>
#else
#define M5IOE1_HAS_M5UNIFIED_I2C 0
#endif

// ============================
// M5Unified I2C_Class 通信封装 (Arduino)
// M5Unified I2C_Class Communication Wrappers (Arduino)
// (C++ only — m5::I2C_Class is a C++ class)
// ============================
#if M5IOE1_HAS_M5UNIFIED_I2C

#ifndef M5IOE1_M5UNIFIED_READ_BYTE
static inline bool M5IOE1_M5UNIFIED_READ_BYTE(m5::I2C_Class *i2c, uint8_t addr, uint8_t reg, uint8_t *data,
                                              uint32_t freq)
{
    bool ok = i2c->readRegister(addr, reg, data, 1, freq);
    M5IOE1_I2C_DELAY_US(M5IOE1_I2C_READ_DELAY_US);
    return ok;
}
#endif

#ifndef M5IOE1_M5UNIFIED_READ_BYTES
static inline bool M5IOE1_M5UNIFIED_READ_BYTES(m5::I2C_Class *i2c, uint8_t addr, uint8_t reg, size_t len, uint8_t *data,
                                               uint32_t freq)
{
    bool ok = i2c->readRegister(addr, reg, data, len, freq);
    M5IOE1_I2C_DELAY_US(M5IOE1_I2C_READ_DELAY_US);
    return ok;
}
#endif

#ifndef M5IOE1_M5UNIFIED_READ_REG16
static inline bool M5IOE1_M5UNIFIED_READ_REG16(m5::I2C_Class *i2c, uint8_t addr, uint8_t reg, uint16_t *data,
                                               uint32_t freq)
{
    uint8_t buf[2];
    if (!i2c->readRegister(addr, reg, buf, 2, freq)) return false;
    M5IOE1_I2C_DELAY_US(M5IOE1_I2C_READ_DELAY_US);
    // 小端模式：低字节在前 / Little-endian: low byte first
    *data = (uint16_t)buf[0] | ((uint16_t)buf[1] << 8);
    return true;
}
#endif

#ifndef M5IOE1_M5UNIFIED_WRITE_BYTE
static inline bool M5IOE1_M5UNIFIED_WRITE_BYTE(m5::I2C_Class *i2c, uint8_t addr, uint8_t reg, uint8_t data,
                                               uint32_t freq)
{
    bool ok = i2c->writeRegister8(addr, reg, data, freq);
    M5IOE1_I2C_DELAY_US(M5IOE1_I2C_WRITE_DELAY_US);
    return ok;
}
#endif

#ifndef M5IOE1_M5UNIFIED_WRITE_BYTES
static inline bool M5IOE1_M5UNIFIED_WRITE_BYTES(m5::I2C_Class *i2c, uint8_t addr, uint8_t reg, size_t len,
                                                const uint8_t *data, uint32_t freq)
{
    bool ok = i2c->writeRegister(addr, reg, data, len, freq);
    M5IOE1_I2C_DELAY_US(M5IOE1_I2C_WRITE_DELAY_US);
    return ok;
}
#endif

#ifndef M5IOE1_M5UNIFIED_WRITE_REG16
static inline bool M5IOE1_M5UNIFIED_WRITE_REG16(m5::I2C_Class *i2c, uint8_t addr, uint8_t reg, uint16_t data,
                                                uint32_t freq)
{
    uint8_t buf[2];
    // 小端模式：低字节在前 / Little-endian: low byte first
    buf[0]  = (uint8_t)(data & 0xFF);
    buf[1]  = (uint8_t)((data >> 8) & 0xFF);
    bool ok = i2c->writeRegister(addr, reg, buf, 2, freq);
    M5IOE1_I2C_DELAY_US(M5IOE1_I2C_WRITE_DELAY_US);
    return ok;
}
#endif

