prodigylinda/ESP32_deskdog_ROM/managed_components/m5stack__m5ioe1/src/M5IOE1_i2c_compat.h
#ifndef M5IOE1_M5UNIFIED_SEND_WAKE
// 产生 I2C START 信号以唤醒处于睡眠的 IOE1
// Generate I2C START signal to wake IOE1 from sleep
static inline bool M5IOE1_M5UNIFIED_SEND_WAKE(m5::I2C_Class *i2c, uint8_t addr, uint32_t freq)
{
    i2c->start(addr, false, freq);
    i2c->stop();
    return true;
}
#endif

#endif  // M5IOE1_HAS_M5UNIFIED_I2C

#else  // ESP-IDF

#include <esp_err.h>
#include <esp_idf_version.h>
#include <esp_rom_sys.h>  // esp_rom_delay_us

// ============================
// I2C 驱动检测
// I2C Driver Detection
// ============================

// 检测 i2c_bus 是否可用
// Detect if i2c_bus is available
//
// ESP-IDF < 5.3.0
//   Without BACKWARD_CONFIG: i2c_bus not supported; use legacy driver/i2c.h API.
//   With    BACKWARD_CONFIG: i2c_bus.h falls back to driver/i2c.h internally, safe to use.
//
// ESP-IDF >= 5.3.0
//   [Highest priority] M5Unified is present:
//     -> i2c_bus mode is not safe because M5Unified owns its I2C_Class bus.
//     Fix: use ioe1.begin(&M5.In_I2C, addr, freq) instead.
//   M5GFX alone:
//     -> header presence is not enough to prove an I2C runtime conflict. Projects that use
//        M5GFX only for display/SPI can still use espressif/i2c_bus for external devices.
//        Do not call lgfx::i2c::init() on the same port while i2c_bus owns it.
//   With    BACKWARD_CONFIG (no M5GFX/M5Unified): i2c_bus.h uses driver/i2c.h internally, safe.
//   Without BACKWARD_CONFIG (no M5GFX/M5Unified):
//     _DRIVER_I2C_H_ defined: i2c_config_t typedef conflict risk, disabled.
//     _DRIVER_I2C_H_ not defined: no conflict risk, enable i2c_bus.
#if __has_include(<i2c_bus.h>)
#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 3, 0)
#if defined(CONFIG_I2C_BUS_BACKWARD_CONFIG)
#define M5IOE1_HAS_I2C_BUS 1  // IDF < 5.3.0 + BACKWARD_CONFIG：可用 / available
#else
#define M5IOE1_HAS_I2C_BUS 0  // IDF < 5.3.0：默认 Legacy API / legacy API by default
#endif
#else
// IDF >= 5.3.0
//
// Runtime conflict (highest priority):
// M5Unified owns an I2C_Class instance. espressif__i2c_bus conflicts with it on both code paths:
//   BACKWARD_CONFIG=y -> i2c_bus.c calls i2c_driver_install() (legacy) -> runtime abort()
//   BACKWARD_CONFIG=n -> i2c_bus_v2.c calls i2c_new_master_bus() on the same port -> undefined behaviour
// Therefore, i2c_bus mode MUST be disabled whenever M5Unified is in the project.
//
// M5GFX alone is intentionally allowed here. The presence of M5GFX.h does not mean lgfx::i2c::init()
// is used, and SPI/display-only M5GFX projects can share the project with espressif__i2c_bus safely.
#if __has_include(<M5Unified.h>)
#if defined(_I2C_BUS_H_)
#error \
    "[M5IOE1] i2c_bus cannot be used together with M5Unified. " \
    "M5Unified owns its I2C_Class bus. " \
    "BACKWARD_CONFIG=y: i2c_bus.c calls i2c_driver_install() (legacy driver) -> runtime abort() in check_i2c_driver_conflict(). " \
    "BACKWARD_CONFIG=n: i2c_bus_v2.c calls i2c_new_master_bus() on the same port -> undefined behaviour. " \
    "Fix: use ioe1.begin(&M5.In_I2C, addr, freq) and set I2C_USE_MODE=0."
#endif
#define M5IOE1_HAS_I2C_BUS 0
#elif defined(CONFIG_I2C_BUS_BACKWARD_CONFIG)
#define M5IOE1_HAS_I2C_BUS 1  // BACKWARD_CONFIG, no M5Unified: compatible
#elif defined(_DRIVER_I2C_H_)
#define M5IOE1_HAS_I2C_BUS 0  // driver/i2c.h already included -> i2c_config_t typedef conflict risk, disabled
#else
#define M5IOE1_HAS_I2C_BUS 1  // no conflict risk
#endif
#endif
#else
#define M5IOE1_HAS_I2C_BUS 0
#endif

// 选择 I2C 驱动头文件
// Select I2C driver header
//
// ESP-IDF < 5.3.0：使用传统 Legacy I2C API（driver/i2c.h），与 i2c_bus 无关
// ESP-IDF < 5.3.0: use legacy I2C API (driver/i2c.h), independent of i2c_bus.
//
// ESP-IDF >= 5.3.0：优先使用新版 i2c_master 驱动
// ESP-IDF >= 5.3.0: prefer the new i2c_master driver.
#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 3, 0)
#include <driver/i2c.h>
#elif __has_include(<driver/i2c_master.h>)
#include <driver/i2c_master.h>
#else
#include <driver/i2c.h>
#endif

// i2c_master 原生驱动可用性检测
// i2c_master native driver availability detection
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0) && __has_include(<driver/i2c_master.h>)
#define M5IOE1_HAS_I2C_MASTER 1
#else
#define M5IOE1_HAS_I2C_MASTER 0
#endif

// ============================
// M5Unified I2C_Class 检测
// M5Unified I2C_Class Detection
// ============================
//
#if M5IOE1_HAS_I2C_BUS
#include <i2c_bus.h>
#else
// i2c_bus 桩类型
// i2c_bus stub types
typedef void *i2c_bus_handle_t;
typedef void *i2c_bus_device_handle_t;
#endif

// 仅 C++ 环境下检测 M5Unified 的 I2C_Class 是否可用。
// Detects whether M5Unified's I2C_Class is available (C++ only).
// 注意：i2c_bus.h 必须先于 I2C_Class.hpp 包含，避免 i2c_config_t typedef 冲突。
// Note: i2c_bus.h must be included before I2C_Class.hpp to avoid i2c_config_t typedef conflict.
#if defined(__cplusplus) && __has_include(<utility/I2C_Class.hpp>)
#define M5IOE1_HAS_M5UNIFIED_I2C 1
#include <utility/I2C_Class.hpp>
#else
#define M5IOE1_HAS_M5UNIFIED_I2C 0
#endif

#ifdef __cplusplus
extern "C" {
#endif

// ============================
// I2C 驱动类型选择
// I2C Driver Type Selection
// ============================
typedef enum {
    M5IOE1_I2C_DRIVER_NONE = 0,      // 未初始化
                                     // Not initialized
    M5IOE1_I2C_DRIVER_SELF_CREATED,  // 使用 i2c_port_t 自创建（IDF >= 5.3.0 用 i2c_master，否则用 Legacy）
                                     // Self-created using i2c_port_t (i2c_master on IDF >= 5.3.0, Legacy otherwise)
    M5IOE1_I2C_DRIVER_MASTER,        // ESP-IDF 原生 i2c_master 驱动（仅 IDF >= 5.3.0）
                                     // ESP-IDF native i2c_master driver (IDF >= 5.3.0 only)
#if M5IOE1_HAS_I2C_BUS
    M5IOE1_I2C_DRIVER_BUS,  // esp-idf-lib i2c_bus 组件
                            // esp-idf-lib i2c_bus component
#endif
#if !M5IOE1_HAS_I2C_MASTER && !M5IOE1_HAS_I2C_BUS
    M5IOE1_I2C_DRIVER_LEGACY,  // 传统 driver/i2c.h API（IDF < 5.3.0 且无 i2c_bus）
                               // Legacy driver/i2c.h API (IDF < 5.3.0 without i2c_bus)
#endif
#if M5IOE1_HAS_M5UNIFIED_I2C
    M5IOE1_I2C_DRIVER_M5UNIFIED,  // 借用 M5Unified I2C_Class 通信（不负责驱动安装/释放）
                                  // Borrow M5Unified I2C_Class for communication (no driver lifecycle)
#endif
} m5ioe1_i2c_driver_t;

// ============================
// ESP-IDF I2C 函数 (i2c_bus)
// ESP-IDF I2C Functions (i2c_bus)
// ============================

