prodigylinda/ESP32_deskdog_ROM/managed_components/m5stack__m5ioe1/src/M5IOE1_i2c_compat.h
#if M5IOE1_HAS_I2C_BUS

#ifndef M5IOE1_I2C_BUS_READ_BYTE
static inline esp_err_t M5IOE1_I2C_BUS_READ_BYTE(i2c_bus_device_handle_t dev, uint8_t reg, uint8_t *data)
{
    esp_err_t ret = i2c_bus_read_byte(dev, reg, data);
    M5IOE1_I2C_DELAY_US(M5IOE1_I2C_READ_DELAY_US);
    return ret;
}
#endif

#ifndef M5IOE1_I2C_BUS_READ_BYTES
static inline esp_err_t M5IOE1_I2C_BUS_READ_BYTES(i2c_bus_device_handle_t dev, uint8_t start_reg, size_t len,
                                                  uint8_t *data)
{
    esp_err_t ret = i2c_bus_read_bytes(dev, start_reg, len, data);
    M5IOE1_I2C_DELAY_US(M5IOE1_I2C_READ_DELAY_US);
    return ret;
}
#endif

#ifndef M5IOE1_I2C_BUS_READ_REG16
static inline esp_err_t M5IOE1_I2C_BUS_READ_REG16(i2c_bus_device_handle_t dev, uint8_t reg, uint16_t *data)
{
    uint8_t buf[2];
    esp_err_t ret = i2c_bus_read_bytes(dev, reg, 2, buf);
    M5IOE1_I2C_DELAY_US(M5IOE1_I2C_READ_DELAY_US);
    if (ret == ESP_OK) {
        // 小端模式：低字节在前
        // Little-endian: low byte first
        *data = (uint16_t)buf[0] | ((uint16_t)buf[1] << 8);
    }
    return ret;
}
#endif

#ifndef M5IOE1_I2C_BUS_WRITE_BYTE
static inline esp_err_t M5IOE1_I2C_BUS_WRITE_BYTE(i2c_bus_device_handle_t dev, uint8_t reg, uint8_t data)
{
    esp_err_t ret = i2c_bus_write_byte(dev, reg, data);
    M5IOE1_I2C_DELAY_US(M5IOE1_I2C_WRITE_DELAY_US);
    return ret;
}
#endif

#ifndef M5IOE1_I2C_BUS_WRITE_BYTES
static inline esp_err_t M5IOE1_I2C_BUS_WRITE_BYTES(i2c_bus_device_handle_t dev, uint8_t start_reg, size_t len,
                                                   const uint8_t *data)
{
    esp_err_t ret = i2c_bus_write_bytes(dev, start_reg, len, (uint8_t *)data);
    M5IOE1_I2C_DELAY_US(M5IOE1_I2C_WRITE_DELAY_US);
    return ret;
}
#endif

#ifndef M5IOE1_I2C_BUS_WRITE_REG16
static inline esp_err_t M5IOE1_I2C_BUS_WRITE_REG16(i2c_bus_device_handle_t dev, uint8_t reg, uint16_t data)
{
    uint8_t buf[2];
    // 小端模式：低字节在前
    // Little-endian: low byte first
    buf[0]        = (uint8_t)(data & 0xFF);
    buf[1]        = (uint8_t)((data >> 8) & 0xFF);
    esp_err_t ret = i2c_bus_write_bytes(dev, reg, 2, buf);
    M5IOE1_I2C_DELAY_US(M5IOE1_I2C_WRITE_DELAY_US);
    return ret;
}
#endif

// 唤醒信号发送 (i2c_bus) / Wake signal send (i2c_bus)
#ifndef M5IOE1_I2C_BUS_SEND_WAKE
static inline esp_err_t M5IOE1_I2C_BUS_SEND_WAKE(i2c_bus_device_handle_t dev, uint8_t reg)
{
    // Read any register to generate I2C start signal for wake
    uint8_t dummy;
    return i2c_bus_read_byte(dev, reg, &dummy);
}
#endif

#else  // !M5IOE1_HAS_I2C_BUS

// ============================
// ESP-IDF I2C 函数 (Legacy - driver/i2c.h，仅 IDF < 5.3.0 且无 i2c_bus)
// ESP-IDF I2C Functions (Legacy - driver/i2c.h, IDF < 5.3.0 without i2c_bus only)
// 使用 IDF 4.3+ 引入的简单 API：i2c_master_write_to_device / i2c_master_write_read_device
// Uses simple API introduced in IDF 4.3+: i2c_master_write_to_device / i2c_master_write_read_device
// ============================

#if !M5IOE1_HAS_I2C_MASTER

#include <freertos/FreeRTOS.h>
#include <freertos/task.h>

// 传统 I2C 超时，单位毫秒 / Legacy I2C timeout in milliseconds
#ifndef M5IOE1_I2C_LEGACY_TIMEOUT_MS
#define M5IOE1_I2C_LEGACY_TIMEOUT_MS 100
#endif

#ifndef M5IOE1_I2C_LEGACY_READ_BYTE
static inline esp_err_t M5IOE1_I2C_LEGACY_READ_BYTE(i2c_port_t port, uint8_t addr, uint8_t reg, uint8_t *data)
{
    esp_err_t ret =
        i2c_master_write_read_device(port, addr, &reg, 1, data, 1, pdMS_TO_TICKS(M5IOE1_I2C_LEGACY_TIMEOUT_MS));
    M5IOE1_I2C_DELAY_US(M5IOE1_I2C_READ_DELAY_US);
    return ret;
}
#endif

#ifndef M5IOE1_I2C_LEGACY_READ_BYTES
static inline esp_err_t M5IOE1_I2C_LEGACY_READ_BYTES(i2c_port_t port, uint8_t addr, uint8_t start_reg, size_t len,
                                                     uint8_t *data)
{
    esp_err_t ret =
        i2c_master_write_read_device(port, addr, &start_reg, 1, data, len, pdMS_TO_TICKS(M5IOE1_I2C_LEGACY_TIMEOUT_MS));
    M5IOE1_I2C_DELAY_US(M5IOE1_I2C_READ_DELAY_US);
    return ret;
}
#endif

#ifndef M5IOE1_I2C_LEGACY_READ_REG16
static inline esp_err_t M5IOE1_I2C_LEGACY_READ_REG16(i2c_port_t port, uint8_t addr, uint8_t reg, uint16_t *data)
{
    uint8_t buf[2];
    esp_err_t ret =
        i2c_master_write_read_device(port, addr, &reg, 1, buf, 2, pdMS_TO_TICKS(M5IOE1_I2C_LEGACY_TIMEOUT_MS));
    M5IOE1_I2C_DELAY_US(M5IOE1_I2C_READ_DELAY_US);
    if (ret == ESP_OK) {
        // 小端模式：低字节在前
        // Little-endian: low byte first
        *data = (uint16_t)buf[0] | ((uint16_t)buf[1] << 8);
    }
    return ret;
}
#endif

#ifndef M5IOE1_I2C_LEGACY_WRITE_BYTE
static inline esp_err_t M5IOE1_I2C_LEGACY_WRITE_BYTE(i2c_port_t port, uint8_t addr, uint8_t reg, uint8_t data)
{
    uint8_t buf[2] = {reg, data};
    esp_err_t ret  = i2c_master_write_to_device(port, addr, buf, 2, pdMS_TO_TICKS(M5IOE1_I2C_LEGACY_TIMEOUT_MS));
    M5IOE1_I2C_DELAY_US(M5IOE1_I2C_WRITE_DELAY_US);
    return ret;
}
#endif

#ifndef M5IOE1_I2C_LEGACY_WRITE_BYTES
static inline esp_err_t M5IOE1_I2C_LEGACY_WRITE_BYTES(i2c_port_t port, uint8_t addr, uint8_t start_reg, size_t len,
                                                      const uint8_t *data)
{
    // 需要在数据前添加寄存器地址
    // Need to prepend register address before data
    uint8_t *buf = (uint8_t *)malloc(len + 1);
    if (buf == NULL) return ESP_ERR_NO_MEM;
    buf[0] = start_reg;
    memcpy(buf + 1, data, len);
    esp_err_t ret = i2c_master_write_to_device(port, addr, buf, len + 1, pdMS_TO_TICKS(M5IOE1_I2C_LEGACY_TIMEOUT_MS));
    free(buf);
    M5IOE1_I2C_DELAY_US(M5IOE1_I2C_WRITE_DELAY_US);
    return ret;
}
#endif

#ifndef M5IOE1_I2C_LEGACY_WRITE_REG16
static inline esp_err_t M5IOE1_I2C_LEGACY_WRITE_REG16(i2c_port_t port, uint8_t addr, uint8_t reg, uint16_t data)
{
    uint8_t buf[3];
    buf[0] = reg;
    // 小端模式：低字节在前
    // Little-endian: low byte first
    buf[1]        = (uint8_t)(data & 0xFF);
    buf[2]        = (uint8_t)((data >> 8) & 0xFF);
    esp_err_t ret = i2c_master_write_to_device(port, addr, buf, 3, pdMS_TO_TICKS(M5IOE1_I2C_LEGACY_TIMEOUT_MS));
    M5IOE1_I2C_DELAY_US(M5IOE1_I2C_WRITE_DELAY_US);
    return ret;
}
#endif

// 唤醒信号发送 (Legacy) / Wake signal send (Legacy)
// 通过读取一个字节来产生 I2C START 信号
// Generates I2C START signal by reading one byte
#ifndef M5IOE1_I2C_LEGACY_SEND_WAKE
static inline esp_err_t M5IOE1_I2C_LEGACY_SEND_WAKE(i2c_port_t port, uint8_t addr)
{
    uint8_t dummy = 0;
    uint8_t reg   = 0x00;
    // 忽略错误：唤醒时设备可能处于睡眠状态，ACK 可能超时
    // Ignore error: device may be asleep during wake, ACK may timeout
    i2c_master_write_read_device(port, addr, &reg, 1, &dummy, 1, pdMS_TO_TICKS(10));
    return ESP_OK;
}
#endif

#endif  // !M5IOE1_HAS_I2C_MASTER

