prodigylinda/ESP32_deskdog_ROM/managed_components/m5stack__m5ioe1/src/M5IOE1_i2c_compat.h
#endif  // M5IOE1_HAS_I2C_BUS

// ============================
// ESP-IDF I2C 函数 (i2c_master - 原生驱动)
// ESP-IDF I2C Functions (i2c_master - native driver)
// 仅 ESP-IDF >= 5.3.0 支持（driver/i2c_master.h 引入于 5.1，API 稳定于 5.3）
// Available on ESP-IDF >= 5.3.0 only (driver/i2c_master.h introduced in 5.1, stable in 5.3)
// ============================

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0)

#ifndef M5IOE1_I2C_MASTER_READ_BYTE
static inline esp_err_t M5IOE1_I2C_MASTER_READ_BYTE(i2c_master_dev_handle_t dev, uint8_t reg, uint8_t *data)
{
    esp_err_t ret = i2c_master_transmit_receive(dev, &reg, 1, data, 1, -1);
    M5IOE1_I2C_DELAY_US(M5IOE1_I2C_READ_DELAY_US);
    return ret;
}
#endif

#ifndef M5IOE1_I2C_MASTER_READ_BYTES
static inline esp_err_t M5IOE1_I2C_MASTER_READ_BYTES(i2c_master_dev_handle_t dev, uint8_t start_reg, size_t len,
                                                     uint8_t *data)
{
    esp_err_t ret = i2c_master_transmit_receive(dev, &start_reg, 1, data, len, -1);
    M5IOE1_I2C_DELAY_US(M5IOE1_I2C_READ_DELAY_US);
    return ret;
}
#endif

#ifndef M5IOE1_I2C_MASTER_READ_REG16
static inline esp_err_t M5IOE1_I2C_MASTER_READ_REG16(i2c_master_dev_handle_t dev, uint8_t reg, uint16_t *data)
{
    uint8_t buf[2];
    esp_err_t ret = i2c_master_transmit_receive(dev, &reg, 1, buf, 2, -1);
    M5IOE1_I2C_DELAY_US(M5IOE1_I2C_READ_DELAY_US);
    if (ret == ESP_OK) {
        // 小端模式：低字节在前
        // Little-endian: low byte first
        *data = (uint16_t)buf[0] | ((uint16_t)buf[1] << 8);
    }
    return ret;
}
#endif

#ifndef M5IOE1_I2C_MASTER_WRITE_BYTE
static inline esp_err_t M5IOE1_I2C_MASTER_WRITE_BYTE(i2c_master_dev_handle_t dev, uint8_t reg, uint8_t data)
{
    uint8_t buf[2] = {reg, data};
    esp_err_t ret  = i2c_master_transmit(dev, buf, 2, -1);
    M5IOE1_I2C_DELAY_US(M5IOE1_I2C_WRITE_DELAY_US);
    return ret;
}
#endif

#ifndef M5IOE1_I2C_MASTER_WRITE_BYTES
static inline esp_err_t M5IOE1_I2C_MASTER_WRITE_BYTES(i2c_master_dev_handle_t dev, uint8_t start_reg, size_t len,
                                                      const uint8_t *data)
{
    // 需要在数据前添加寄存器地址
    // Need to prepend register address
    uint8_t *buf = (uint8_t *)malloc(len + 1);
    if (buf == NULL) return ESP_ERR_NO_MEM;
    buf[0] = start_reg;
    memcpy(buf + 1, data, len);
    esp_err_t ret = i2c_master_transmit(dev, buf, len + 1, -1);
    free(buf);
    M5IOE1_I2C_DELAY_US(M5IOE1_I2C_WRITE_DELAY_US);
    return ret;
}
#endif

#ifndef M5IOE1_I2C_MASTER_WRITE_REG16
static inline esp_err_t M5IOE1_I2C_MASTER_WRITE_REG16(i2c_master_dev_handle_t dev, uint8_t reg, uint16_t data)
{
    uint8_t buf[3];
    buf[0] = reg;
    // 小端模式：低字节在前
    // Little-endian: low byte first
    buf[1]        = (uint8_t)(data & 0xFF);
    buf[2]        = (uint8_t)((data >> 8) & 0xFF);
    esp_err_t ret = i2c_master_transmit(dev, buf, 3, -1);
    M5IOE1_I2C_DELAY_US(M5IOE1_I2C_WRITE_DELAY_US);
    return ret;
}
#endif

// 唤醒信号发送 (i2c_master) / Wake signal send (i2c_master)
#ifndef M5IOE1_I2C_MASTER_SEND_WAKE
static inline esp_err_t M5IOE1_I2C_MASTER_SEND_WAKE(i2c_master_bus_handle_t bus, uint8_t addr)
{
    // Use i2c_master_probe to generate START signal for wake
    return i2c_master_probe(bus, addr, 10);
}
#endif

#endif  // ESP_IDF_VERSION >= 5.3.0

#ifdef __cplusplus
}
#endif

// ============================
// M5Unified I2C_Class 通信封装
// M5Unified I2C_Class Communication Wrappers
// (C++ only — m5::I2C_Class is a C++ class)
// ============================
#if M5IOE1_HAS_M5UNIFIED_I2C
#ifdef __cplusplus

#ifndef M5IOE1_M5UNIFIED_READ_BYTE
static inline bool M5IOE1_M5UNIFIED_READ_BYTE(m5::I2C_Class *i2c, uint8_t addr, uint8_t reg, uint8_t *data,
                                              uint32_t freq)
{
    bool ok = i2c->readRegister(addr, reg, data, 1, freq);
    M5IOE1_I2C_DELAY_US(M5IOE1_I2C_READ_DELAY_US);
    return ok;
}
#endif

#ifndef M5IOE1_M5UNIFIED_READ_BYTES
static inline bool M5IOE1_M5UNIFIED_READ_BYTES(m5::I2C_Class *i2c, uint8_t addr, uint8_t reg, size_t len, uint8_t *data,
                                               uint32_t freq)
{
    bool ok = i2c->readRegister(addr, reg, data, len, freq);
    M5IOE1_I2C_DELAY_US(M5IOE1_I2C_READ_DELAY_US);
    return ok;
}
#endif

#ifndef M5IOE1_M5UNIFIED_READ_REG16
static inline bool M5IOE1_M5UNIFIED_READ_REG16(m5::I2C_Class *i2c, uint8_t addr, uint8_t reg, uint16_t *data,
                                               uint32_t freq)
{
    uint8_t buf[2];
    if (!i2c->readRegister(addr, reg, buf, 2, freq)) return false;
    M5IOE1_I2C_DELAY_US(M5IOE1_I2C_READ_DELAY_US);
    // 小端模式：低字节在前 / Little-endian: low byte first
    *data = (uint16_t)buf[0] | ((uint16_t)buf[1] << 8);
    return true;
}
#endif

#ifndef M5IOE1_M5UNIFIED_WRITE_BYTE
static inline bool M5IOE1_M5UNIFIED_WRITE_BYTE(m5::I2C_Class *i2c, uint8_t addr, uint8_t reg, uint8_t data,
                                               uint32_t freq)
{
    bool ok = i2c->writeRegister8(addr, reg, data, freq);
    M5IOE1_I2C_DELAY_US(M5IOE1_I2C_WRITE_DELAY_US);
    return ok;
}
#endif

#ifndef M5IOE1_M5UNIFIED_WRITE_BYTES
static inline bool M5IOE1_M5UNIFIED_WRITE_BYTES(m5::I2C_Class *i2c, uint8_t addr, uint8_t reg, size_t len,
                                                const uint8_t *data, uint32_t freq)
{
    bool ok = i2c->writeRegister(addr, reg, data, len, freq);
    M5IOE1_I2C_DELAY_US(M5IOE1_I2C_WRITE_DELAY_US);
    return ok;
}
#endif

#ifndef M5IOE1_M5UNIFIED_WRITE_REG16
static inline bool M5IOE1_M5UNIFIED_WRITE_REG16(m5::I2C_Class *i2c, uint8_t addr, uint8_t reg, uint16_t data,
                                                uint32_t freq)
{
    uint8_t buf[2];
    // 小端模式：低字节在前 / Little-endian: low byte first
    buf[0]  = (uint8_t)(data & 0xFF);
    buf[1]  = (uint8_t)((data >> 8) & 0xFF);
    bool ok = i2c->writeRegister(addr, reg, buf, 2, freq);
    M5IOE1_I2C_DELAY_US(M5IOE1_I2C_WRITE_DELAY_US);
    return ok;
}
#endif

#ifndef M5IOE1_M5UNIFIED_SEND_WAKE
// 产生 I2C START 信号以唤醒处于睡眠的 IOE1
// Generate I2C START signal to wake IOE1 from sleep
static inline bool M5IOE1_M5UNIFIED_SEND_WAKE(m5::I2C_Class *i2c, uint8_t addr, uint32_t freq)
{
    i2c->start(addr, false, freq);
    i2c->stop();
    return true;
}
#endif

#endif  // __cplusplus
#endif  // M5IOE1_HAS_M5UNIFIED_I2C

#endif  // ARDUINO

#endif  // __M5IOE1_I2C_COMPAT_H__
